{"pageProps":{"content":"\n<div class=\"iframe-video-wrapper\">\n    <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/xPMbqHUlyyU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n</div>\n\nThere is a long history of an effort made to explore musical elements with the entities and spaces around us, such as musique concrète and ambient music. In the context of computer music and digital art, interactive experiences that concentrate on the surrounding objects and physical spaces have also been designed. In recent years, with the development and popularization of devices, an increasing number of works have been designed in Extended Reality to create such musical experiences. In this paper, we describe MR4MR, a sound installation work that allows users to experience melodies produced from interactions with their surrounding space in the context of Mixed Reality (MR). Using HoloLens, an MR head-mounted display, users can bump virtual objects that emit sound against real objects in their surroundings. Then, by continuously creating a melody following the sound made by the object and re-generating randomly and gradually changing melody using music generation machine learning models, users can feel their ambient melody \"reincarnating\".\n\nThis work has exhibited in NTT Intercommunication Center\n\n<https://www.ntticc.or.jp/ja/archive/works/mr4mr-mixed-reality-for-melody-reincarnation/>\n\n\n[![Image from Gyazo](https://i.gyazo.com/7866eb5bfa812c8c486078d8a7cba279.gif)](https://gyazo.com/7866eb5bfa812c8c486078d8a7cba279)\n\n## Paper\n\n[[2209.07023] MR4MR: Mixed Reality for Melody Reincarnation](https://arxiv.org/abs/2209.07023)\n\nPlease cite as\n\n_Kobayashi, Atsuya, Ishino, Ryogo, Nobusue, Ryuku, Inoue, Takumi, Okazaki, Keisuke, Sawa, Shoma, & Tokui, Nao. (2022, September 17). MR4MR: Mixed Reality for Melody Reincarnation. Proceedings of the 3rd Conference on AI Music Creativity. The 3rd Conference on AI Music Creativity (AIMC 2022). https://doi.org/10.5281/zenodo.7088357_\n\nBibtex\n\n```bibtex\n@inproceedings{kobayashi_mr4mr2022,\n  title        = {MR4MR: Mixed Reality for Melody Reincarnation},\n  author       = {\n    Kobayashi, Atsuya and Ishino, Ryogo and Nobusue, Ryuku and Inoue, Takumi\n    and Okazaki, Keisuke and Sawa, Shoma and Tokui, Nao\n  },\n  year         = 2022,\n  month        = {Sep},\n  booktitle    = {Proceedings of the 3rd Conference on AI Music Creativity},\n  publisher    = {AIMC},\n  doi          = {10.5281/zenodo.7088357},\n  abstractnote = {\n    <p>There is a long history of an effort made to explore musical elements\n    with the entities and spaces around us, such as musique concr&egrave;te and\n    ambient music. In the context of computer music and digital art,\n    interactive experiences that concentrate on the surrounding objects and\n    physical spaces have also been designed. In recent years, with the\n    development and popularization of devices, an increasing number of works\n    have been designed in Extended Reality to create such musical experiences.\n    In this paper, we describe MR4MR, a sound installation work that allows\n    users to experience melodies produced from interactions with their\n    surrounding space in the context of Mixed Reality (MR). Using HoloLens, an\n    MR head-mounted display, users can bump virtual objects that emit sound\n    against real objects in their surroundings. Then, by continuously creating\n    a melody following the sound made by the object and re-generating randomly\n    and gradually changing melody using music generation machine learning\n    models, users can feel their ambient melody &quot;reincarnating&quot;.</p>\n  }\n}\n\n```\n","data":{"description":"MR4MR: Mixed Reality for Melody Reincarnation","title":"MR4MR: Mixed Reality for Melody Reincarnation","slug":"mr4mr","date":"2022-09-15T12:00:00.000Z","category":"Interaction Design","tags":["Music","AI","XR","Mixed Reality"],"keyVisual":"/images/works/mr4mr.jpg"}},"__N_SSG":true}